Tekla Open API Reference for Tekla Structures 2025
CurvedDimensionSetRadial.CurvedDimensionSetRadialAttributes.DimensionType Property
 The dimension type.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DimensionSetBaseAttributes.DimensionTypes DimensionType { get; set; }
Public Property DimensionType As DimensionSetBaseAttributes.DimensionTypes
	Get
	Set
Property Value
Type: DimensionSetBaseAttributes.DimensionTypes
See Also
Reference
CurvedDimensionSetRadial.CurvedDimensionSetRadialAttributes Class
Tekla.Structures.Drawing Namespace